CourseProject_V3/runs/web-2026-09-13T19-44-10-248Z/case/constant/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

viscosityModel  constant;
nu              1.006e-06;
